#1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

a=5
b=25
if a==b*b:
    print (f'{a} является квадратом {b}')
lif b!=a*a:
    print (f'{a} не является квадратом {b}')